package collection;


public class CollectionBasic_614 {
    /*
    컬렉션 프레임워크 : 다수의 데이터를 관리**하기 위해 자바에서 제공하는 기능 사용
    컬렉션 : 데이터 모음집
    컬렉션 프레임워크에는 기본 자료형 저장 불가* (wrapper 클래스 사용, ex/ Integer)

    제공되는 인터페이스(자료구조에 따라 데이터의 저장 형태가 달라지기 때문에 4가지 방법)
    List,      Set,     Queue,   Map
    (많이 사용),(잘 안씀),(잘 안씀),(꾀 씀)

    List에 저장되는 데이터의 특징 : 데이터의 순번 존재, 데이터의 중복 가능 (배열과 비슷)
    Set에 저장되는 데이터의 특징 : 데이터의 순번 없음, 데이터의 중복 불가

    (인터페이스는 클래스를 만들어야 얹혀서 사용할 수 있는데, 기본적으로 제공됨)
    List 인터페이스를 구현한 클래스
    - ArrayList* (읽기만 하면 빠름)
    - LinkedList (자료추가 삭제 상대적으로 빠름)

    ***면접 기출***
    자료구조!
    stack(L.I.F.O) last in first out
    (깊은 통에 쌓아 넣는 느낌~ 입력 순서 반대로 출력, 선입후출)
    Queue(F.I.F.O) first in first out
    (관을 통과하는 느낌~ 입력 순서대로 출력, 선입선출)
     */
}
